[
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "amplification attack",
        "definition": "A class of attack where the attacker attempts to exhaust a target system's\nCPU, storage, network, or other resources by providing small, valid inputs into\nthe system that result in damaging effects that can be exponentially more costly\nto process than the inputs themselves.",
        "anchor": "amplificationattack"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "authenticate",
        "definition": "Authentication is a process by which an entity can prove it has a specific\nattribute or controls a specific secret using one or more verification\nmethods. With DIDs, a common example would be proving control of the\ncryptographic private key associated with a public key published in a DID\ndocument.",
        "anchor": "authenticate"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "cryptographic suite",
        "definition": "A specification defining the usage of specific cryptographic primitives in\norder to achieve a particular security goal. These documents are often used\nto specify verification methods, digital signature types,\ntheir identifiers, and other related properties.",
        "anchor": "cryptographicsuite"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "decentralized identifier (DID)",
        "definition": "A globally unique persistent identifier that does not require a centralized\nregistration authority and is often generated and/or registered\ncryptographically. The generic format of a DID is defined in 3.1 DID Syntax. A specific DID scheme is defined in a DID\nmethod specification. Many—but not all—DID methods make use of\ndistributed ledger technology (DLT) or some other form of decentralized\nnetwork.",
        "anchor": "decentralizedidentifier(DID)"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "decentralized identity management",
        "definition": "Identity\nmanagement that is based on the use of decentralized identifiers.\nDecentralized identity management extends authority for identifier generation,\nregistration, and assignment beyond traditional roots of trust such as\nX.500 directory services,\nthe Domain Name System,\nand most national ID systems.",
        "anchor": "decentralizedidentitymanagement"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "DID controller",
        "definition": "An entity that has the capability to make changes to a DID document. A\nDID might have more than one DID controller. The DID controller(s)\ncan be denoted by the optional controller property at the top level of the\nDID document. Note that a DID controller might be the DID\nsubject.",
        "anchor": "DIDcontroller"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "DID delegate",
        "definition": "An entity to whom a DID controller has granted permission to use a\nverification method associated with a DID via a DID\ndocument. For example, a parent who controls a child's DID document\nmight permit the child to use their personal device in order to\nauthenticate. In this case, the child is the DID delegate. The\nchild's personal device would contain the private cryptographic material\nenabling the child to authenticate using the DID. However, the child\nmight not be permitted to add other personal devices without the parent's\npermission.",
        "anchor": "DIDdelegate"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "DID document",
        "definition": "A set of data describing the DID subject, including mechanisms, such as\ncryptographic public keys, that the DID subject or a DID delegate\ncan use to authenticate itself and prove its association with the\nDID. A DID document might have one or more different\nrepresentations as defined in 6. Representations or in the\nW3C DID Specification Registries [DID-SPEC-REGISTRIES].",
        "anchor": "DIDdocument"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "DID fragment",
        "definition": "The portion of a DID URL that follows the first hash sign character\n(#). DID fragment syntax is identical to URI fragment syntax.",
        "anchor": "DIDfragment"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "DID method",
        "definition": "A definition of how a specific DID method scheme is implemented. A DID method is\ndefined by a DID method specification, which specifies the precise operations by\nwhich DIDs and DID documents are created, resolved, updated,\nand deactivated. See 8. Methods.",
        "anchor": "DIDmethod"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "DID path",
        "definition": "The portion of a DID URL that begins with and includes the first forward\nslash (/) character and ends with either a question mark\n(?) character, a fragment hash sign (#) character,\nor the end of the DID URL. DID path syntax is identical to URI path syntax.\nSee Path.",
        "anchor": "DIDpath"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "DID query",
        "definition": "The portion of a DID URL that follows and includes the first question\nmark character (?). DID query syntax is identical to URI query\nsyntax. See Query.",
        "anchor": "DIDquery"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "DID resolution",
        "definition": "The process that takes as its input a DID and a set of resolution\noptions and returns a DID document in a conforming representation\nplus additional metadata. This process relies on the \"Read\" operation of the\napplicable DID method. The inputs and outputs of this process are\ndefined in 7.1 DID Resolution.",
        "anchor": "DIDresolution"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "DID resolver",
        "definition": "A DID resolver is a software and/or hardware component that performs the\nDID resolution function by taking a DID as input and producing a\nconforming DID document as output.",
        "anchor": "DIDresolver"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "DID scheme",
        "definition": "The formal syntax of a decentralized identifier. The generic DID scheme\nbegins with the prefix did: as defined in 3.1 DID Syntax. Each DID method specification defines a specific\nDID method scheme that works with that specific DID method. In a specific DID\nmethod scheme, the DID method name follows the first colon and terminates with\nthe second colon, e.g., did:example:",
        "anchor": "DIDscheme"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "DID subject",
        "definition": "The entity identified by a DID and described by a DID document.\nAnything can be a DID subject: person, group, organization, physical thing,\ndigital thing, logical thing, etc.",
        "anchor": "DIDsubject"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "DID URL",
        "definition": "A DID plus any additional syntactic component that conforms to the\ndefinition in 3.2 DID URL Syntax. This includes an optional DID\npath (with its leading / character), optional DID query\n(with its leading ? character), and optional DID fragment\n(with its leading # character).",
        "anchor": "DIDURL"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "DID URL dereferencing",
        "definition": "The process that takes as its input a DID URL and a set of input\nmetadata, and returns a resource. This resource might be a DID\ndocument plus additional metadata, a secondary resource\ncontained within the DID document, or a resource entirely\nexternal to the DID document. The process uses DID resolution to\nfetch a DID document indicated by the DID contained within the\nDID URL. The dereferencing process can then perform additional processing\non the DID document to return the dereferenced resource indicated by the\nDID URL. The inputs and outputs of this process are defined in\n7.2 DID URL Dereferencing.",
        "anchor": "DIDURLdereferencing"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "DID URL dereferencer",
        "definition": "A software and/or hardware system that performs the DID URL dereferencing\nfunction for a given DID URL or DID document.",
        "anchor": "DIDURLdereferencer"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "distributed ledger (DLT)",
        "definition": "A non-centralized system for recording events. These systems establish\nsufficient confidence for participants to rely upon the data recorded by others\nto make operational decisions. They typically use distributed databases where\ndifferent nodes use a consensus protocol to confirm the ordering of\ncryptographically signed transactions. The linking of digitally signed\ntransactions over time often makes the history of the ledger effectively\nimmutable.",
        "anchor": "distributedledger(DLT)"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "public key description",
        "definition": "A data object contained inside a DID document that contains all the\nmetadata necessary to use a public key or a verification key.",
        "anchor": "publickeydescription"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "resource",
        "definition": "As defined by [RFC3986]: \"...the term 'resource' is used in a general sense\nfor whatever might be identified by a URI.\" Similarly, any resource might serve\nas a DID subject identified by a DID.",
        "anchor": "resource"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "representation",
        "definition": "As defined for HTTP by [RFC7231]: \"information that is intended to reflect a\npast, current, or desired state of a given resource, in a format that can be\nreadily communicated via the protocol, and that consists of a set of\nrepresentation metadata and a potentially unbounded stream of representation\ndata.\" A DID document is a representation of information describing a\nDID subject. See 6. Representations.",
        "anchor": "representation"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "representation-specific entries",
        "definition": "Entries in a DID document whose meaning is particular to a specific\nrepresentation. Defined in 4. Data Model and\n6. Representations. For example, @context in\nthe JSON-LD representation is a\nrepresentation-specific entry.",
        "anchor": "representationspecificentries"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "services",
        "definition": "Means of communicating or interacting with the DID subject or\nassociated entities via one or more service endpoints.\nExamples include discovery services, agent services, social networking\nservices, file storage services, and verifiable credential repository services.",
        "anchor": "services"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "service endpoint",
        "definition": "A network address, such as an HTTP URL, at which services operate on\nbehalf of a DID subject.",
        "anchor": "serviceendpoint"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "Uniform Resource Identifier (URI)",
        "definition": "The standard identifier format for all resources on the World Wide Web as\ndefined by [RFC3986]. A DID is a type of URI scheme.",
        "anchor": "UniformResourceIdentifier(URI)"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "verifiable credential",
        "definition": "A standard data model and representation format for cryptographically-verifiable\ndigital credentials as defined by the W3C Verifiable Credentials specification\n[VC-DATA-MODEL].",
        "anchor": "verifiablecredential"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "verifiable data registry",
        "definition": "A system that facilitates the creation, verification, updating, and/or\ndeactivation of decentralized identifiers and DID documents. A\nverifiable data registry might also be used for other\ncryptographically-verifiable data structures such as verifiable\ncredentials. For more information, see the W3C Verifiable Credentials\nspecification [VC-DATA-MODEL].",
        "anchor": "verifiabledataregistry"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "verifiable timestamp",
        "definition": "A verifiable timestamp enables a third-party to verify that a data object\nexisted at a specific moment in time and that it has not been modified or\ncorrupted since that moment in time. If the data integrity could reasonably have\nbeen modified or corrupted since that moment in time, the timestamp is not\nverifiable.",
        "anchor": "verifiabletimestamp"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "verification method",
        "definition": "A set of parameters that can be used together with a process to independently\nverify a proof. For example, a cryptographic public key can be used as a\nverification method with respect to a digital signature; in such usage, it\nverifies that the signer possessed the associated cryptographic private key.\n    \n    \n\"Verification\" and \"proof\" in this definition are intended to apply broadly. For\nexample, a cryptographic public key might be used during Diffie-Hellman key\nexchange to negotiate a shared symmetric key for encryption. This guarantees the\nintegrity of the key agreement process. It is thus another type of verification\nmethod, even though descriptions of the process might not use the words\n\"verification\" or \"proof.\"",
        "anchor": "verificationmethod"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "verification relationship",
        "definition": "An expression of the relationship between the DID subject and a\nverification method. An example of a verification relationship is\n5.3.1 Authentication.",
        "anchor": "verificationrelationship"
    },
    {
        "organisation": "W3C (DID)",
        "url": "https://www.w3.org/TR/did-core",
        "term": "Universally Unique Identifier (UUID)",
        "definition": "A type of globally unique identifier defined by [RFC4122]. UUIDs are similar\nto DIDs in that they do not require a centralized registration authority. UUIDs\ndiffer from DIDs in that they are not resolvable or\ncryptographically-verifiable.",
        "anchor": "UniversallyUniqueIdentifier(UUID)"
    }
]